
  function f_find(aU,key,j)
  {
    for(var i=0;i<aU.length;i++)
    {
      if(aU[i][0]==key)
      {
        return aU[i][j];
      }

    }
    return null;
  }
    function f_find2(aM,key,j)
  {
    for(var i=0;i<aM.length;i++)
    {
      if(aM[i][0]==key)
      {
        return aM[i][j];
      }

    }
    return null;
  }
// Usage  {"华东地区","华南地区","华中地区","华北地区","西北地区","西南地区","东北地区","台港澳地区"};
var aU = new Array();

aU[0] = new Array("2a", "", "华东地区");
aU[1] = new Array("2b", "", "华南地区");
aU[2] = new Array("2c", "", "华中地区");
aU[3] = new Array("2d", "", "华北地区");
aU[4] = new Array("2e", "", "西北地区");
aU[5] = new Array("2f", "", "西南地区");
aU[6] = new Array("2g", "", "东北地区");
aU[7] = new Array("2h", "", "台港澳地区");

//1、华东地区（包括山东37、江苏32、安徽34、浙江33、福建35、上海31）；
//2、华南地区（包括广东44、广西45、海南46）；
//3、华中地区（包括湖北42、湖南43、河南41、江西36）；
//4、华北地区（包括北京11、天津12、河北13、山西14、内蒙古15）；
//5、西北地区（包括宁夏64、新疆65、青海63、陕西61、甘肃62）；
//6、西南地区（包括四川51、云南、贵州52、西藏54、重庆50）；
//7、东北地区（包括辽宁21、吉林22、黑龙江23）；
//8、台港澳地区（包括台湾、香港、澳门）。
11	北京市,12	天津市,13	河北省,14	山西省,15	内蒙古省,21	辽宁省,22	吉林省,,23	黑龙江省,31	上海市,32	江苏省
33	浙江省,34	安徽省,35	福建省,36	江西省,37	山东省,41	河南省,42	湖北省,,43	湖南省,44	广东省,45	广西省,46	海南省,50	重庆市,51	四川省,52	贵州省,
53	云南省,54	西藏省,61	陕西省,62	甘肃省,63	青海省,64	宁夏省65	新疆省

// Medi
var aM = new Array();
aM[0] = new Array("11","北京市","2a");
aM[1] = new Array("12","天津市","2a");
aM[2] = new Array("13","河北省","2a");
aM[3] = new Array("14","山西省","2a");
aM[4] = new Array("15","内蒙古省","2a");
aM[5] = new Array("21","辽宁省","2a");
aM[6] = new Array("22","吉林省","2a");
aM[7] = new Array("23","黑龙江省","2a");
aM[8] = new Array("31","上海市","2a");
aM[9] = new Array("32","江苏省","2a");
aM[10] = new Array("33","浙江省","2a");
aM[11] = new Array("34","安徽省","2a");
aM[12] = new Array("35","福建省","2a");
aM[13] = new Array("36","江西省","2a");
aM[14] = new Array("37","山东省","2a");
aM[15] = new Array("41","河南省","2a");
aM[16] = new Array("42","湖北省","2a");
aM[17] = new Array("43","湖南省","2a");
aM[18] = new Array("44","广东省","2a");
aM[19] = new Array("45","广西省","2a");
aM[20] = new Array("46","海南省","2a");
aM[21] = new Array("50","重庆市","2a");
aM[22] = new Array("51","四川省","2a");
aM[23] = new Array("52","贵州省","2a");
aM[24] = new Array("53","云南省","2a");
aM[25] = new Array("54","西藏省","2a");
aM[26] = new Array("61","陕西省","2a");
aM[27] = new Array("62","甘肃省","2a");
aM[28] = new Array("63","青海省","2a");
aM[29] = new Array("64","宁夏省","2a");
aM[30] = new Array("65","新疆省","2a");
//aM[48] = new Array("40", "2e", "0.4", "Consumer Magazine", "7e", "3e", "4c", "0", "6e", "1");



// Image Size
var aI = new Array();

aI[0] = new Array("3a", "10", "1000", "路牌广告","3","200","4a");
aI[1] = new Array("3a", "1", "1000", "悬垂幕广告","3","200","4a");
aI[2] = new Array("3a", "2", "1000", "候车亭广告","10","200","4a");
aI[3] = new Array("3a", "11", "1000", "灯箱（户外）","10","200","4a");
aI[4] = new Array("3a", "3", "1000", "招贴（户外）","","","");
aI[5] = new Array("3a", "4", "1000", "路灯柱广告"),"","","";
aI[6] = new Array("3a", "21", "1000", "视听（户外）","","","");
aI[7] = new Array("3a", "5", "1000", "广告墙（户外）","2","200","4a");
aI[8] = new Array("3a", "6", "1000", "广告柱、广告立牌","10","200","4a");
aI[9] = new Array("3a", "7", "4000", "全户外","","","");
aI[10] = new Array("3b", "12", "1000", "厢内广告","5","200");
aI[11] = new Array("3b", "13", "1000", "厢体广告","5","200");
aI[12] = new Array("3b", "22", "1000", "台、候机楼、候车室","","","");
aI[13] = new Array("3c", "23", "500", "一种报纸/杂志","0","250","4a");
aI[14] = new Array("3c", "24", "2500", "全报纸/杂志");
aI[15] = new Array("3c", "14", "3500", "全报纸+杂志","","","");
aI[16] = new Array("3d", "15", "500", "单一网站","1","250","4a");
aI[17] = new Array("3d", "16", "2000", "全网络","","","");
aI[18] = new Array("3e", "17", "500", "单一","","","");
aI[19] = new Array("3e", "18", "1000", "全POSM","","","");
aI[20] = new Array("3f", "19", "500", "非商业性展览/活动（博物馆等）","","","");
aI[21] = new Array("3f", "99", "500", "商业性展览/活动","","","");
aI[22] = new Array("3f", "25", "1000", "全商业展展览/活动","","","");
aI[23] = new Array("3h", "29", "1000", "店面POP","","","");
aI[24] = new Array("3h", "30", "500", "单一地面POP","","","");
aI[25] = new Array("3h", "31", "500", "单一壁面POP","","","");
aI[26] = new Array("3h", "32", "1500", "单一悬挂POP","","","");
aI[27] = new Array("3h", "33", "2500", "单一货架POP","","","");
aI[28] = new Array("3h", "34", "500", "单一指示POP","","","");
aI[29] = new Array("3h", "35", "500", "5种POP","","","");
aI[30] = new Array("3h", "36", "500", "全POP","","","");
aI[31] = new Array("3h", "37", "500", "计算机","","","");
aI[32] = new Array("3i", "38", "500", "电子信（newsletter）","","","");
aI[33] = new Array("3i", "39", "500", "宣传单页","","","");
aI[34] = new Array("3j", "40", "500", "车票","","","");
aI[35] = new Array("3j", "41", "500", "演出票","","","");
aI[36] = new Array("3j", "42", "500", "站台票","","","");
aI[37] = new Array("3k", "43", "500", "银行卡","","","");
aI[38] = new Array("3k", "44", "500", "IC卡","","","");
aI[39] = new Array("3k", "45", "500", "冲值卡","","","");
aI[40] = new Array("3k", "46", "500", "电信卡","","","");
aI[41] = new Array("3l", "47", "500", "手机","","","");
aI[42] = new Array("3l", "48", "500", "PDA","","","");
aI[43] = new Array("3l", "49", "500", "商业软件","","","");
aI[44] = new Array("3l", "50", "500", "计算机","","","");
aI[45] = new Array("3m", "51", "500", "贺卡","","","");
aI[46] = new Array("3m", "52", "500", "彩信","","","");
aI[47] = new Array("3m", "53", "500", "MMS","","","");
aI[48] = new Array("3m", "54", "500", "壁纸","","","");
aI[49] = new Array("3m", "94", "500", "屏保","","","");
aI[50] = new Array("3m", "55", "500", "主题","","","");
aI[51] = new Array("3m", "56", "500", "个性化邮票","","","");
aI[52] = new Array("3m", "57", "500", "游戏","","","");
aI[53] = new Array("3n", "58", "500", "书签","","","");
aI[54] = new Array("3n", "59", "500", "笔记本","","","");
aI[55] = new Array("3n", "81", "500", "信纸","","","");
aI[56] = new Array("3n", "82", "500", "鼠标垫","","","");
aI[57] = new Array("3n", "60", "500", "垫板","","","");
aI[58] = new Array("3n", "61", "500", "便签等","","","");

// Print Run
var aP = new Array();

aP[0] = new Array("4a", "0", "0.85", "0");
aP[1] = new Array("4a", "1", "0.9", "1");
aP[2] = new Array("4a", "2", "0.93", "2");
aP[3] = new Array("4a", "3", "1", "3");
aP[4] = new Array("4a", "4", "1.125", "4");
aP[5] = new Array("4a", "5", "1.25", "5");
aP[6] = new Array("4a", "6", "1.375", "6");
aP[7] = new Array("4a", "7", "1.45", "7");
aP[8] = new Array("4a", "8", "1.5", "8");
aP[9] = new Array("4a", "9", "1.65", "9");
aP[10] = new Array("4a", "10", "1.75", "10");
aP[11] = new Array("4a", "11", "1.9", "11");
aP[12] = new Array("4a", "12", "2.3", "12");
aP[13] = new Array("4a", "13", "2.5", "13");
aP[14] = new Array("4a", "14", "0.17", "14");
aP[15] = new Array("4a", "15", "0.2", "15");
aP[16] = new Array("4a", "16", "0.225", "16");
aP[17] = new Array("4a", "17", "0.26", "17");
aP[18] = new Array("4a", "18", "0.32", "18");
aP[19] = new Array("4a", "19", "0.38", "19");
aP[20] = new Array("4a", "20", "0.435", "20");
aP[21] = new Array("4a", "21", "0.545", "21");
aP[22] = new Array("4a", "22", "0.64", "22");
aP[23] = new Array("4a", "23", "0.68", "23");
aP[24] = new Array("4a", "24", "0.8", "24");
aP[25] = new Array("4a", "25", "0.95", "25");
aP[26] = new Array("4a", "26", "1.05", "26");
aP[27] = new Array("4a", "27", "1.1", "27");
aP[28] = new Array("4a", "28", "1.2", "28");
aP[29] = new Array("4a", "29", "1.35", "29");
aP[30] = new Array("4a", "30", "1.45", "30");
aP[31] = new Array("4a", "31", "1.65", "31");
aP[32] = new Array("4a", "32", "1.8", "32");
aP[33] = new Array("4a", "33", "1.95", "33");
aP[34] = new Array("4a", "34", "2.1", "34");
aP[35] = new Array("4a", "35", "1", "35");
aP[36] = new Array("4a", "36", "1.2", "36");
aP[37] = new Array("4a", "37", "1.4", "37");
aP[38] = new Array("4a", "38", "1.6", "38");
aP[39] = new Array("4a", "39", "2", "39");
aP[40] = new Array("4a", "40", "2.4", "40");
aP[41] = new Array("4a", "41", "0.9", "41");
aP[42] = new Array("4a", "42", "0.95", "42");
aP[43] = new Array("4a", "43", "1", "43");
aP[44] = new Array("4a", "44", "1.025", "44");
aP[45] = new Array("4a", "45", "1.05", "45");
aP[46] = new Array("4a", "46", "1.075", "46");
aP[47] = new Array("4a", "47", "1.1", "47");
aP[48] = new Array("4a", "48", "1.15", "48");
aP[49] = new Array("4a", "49", "1.25", "49");
aP[50] = new Array("4a", "50", "1", "50");
aP[51] = new Array("4a", "51", "1.43", "51");
aP[52] = new Array("4a", "52", "1.8", "52");
aP[53] = new Array("4a", "53", "2", "53");
aP[54] = new Array("4a", "54", "2.4", "54");
aP[55] = new Array("4a", "551", "2.64", "55");
aP[56] = new Array("4a", "562", "2.88", "56");
aP[57] = new Array("4a", "57", "1", "57");
aP[58] = new Array("4a", "58", "1.1", "58");
aP[59] = new Array("4a", "59", "1.2", "59");
aP[60] = new Array("4g", "60", "1.3", "60");
