package tea.entity.site;

import tea.db.DbAdapter;
import tea.entity.Cache;
import java.sql.SQLException;
import java.sql.SQLException;

public class Communityweather
{
	private static Cache _cache = new Cache(100);
	private String community;
	private boolean exists;
	private int area;
	private int node;
	public static final String AREA_TYPE[][] = { { "直辖市", "北京", "上海", "天津", "重庆" }, { "特别行政区", "香港", "澳门" }, { "黑龙江", "哈尔滨", "齐齐哈尔", "牡丹江", "大庆", "伊春", "双鸭山", "鹤岗", "鸡西", "佳木斯", "七台河", "黑河", "绥化", "大兴安岭" }, { "吉林", "长春", "延边", "吉林", "白山", "白城", "四平", "松原", "辽源", "大安", "通化" }, { "辽宁", "沈阳", "大连", "葫芦岛", "旅顺", "本溪", "抚顺", "铁岭", "辽阳", "营口", "阜新", "朝阳", "锦州", "丹东", "鞍山" }, { "内蒙古", "呼和浩特", "呼伦贝尔", "锡林浩特", "包头", "赤峰", "海拉尔", "乌海", "鄂尔多斯", "锡林浩特", "通辽" },
			{ "河北", "石家庄", "唐山", "张家口", "廊坊", "邢台", "邯郸", "沧州", "衡水", "承德", "保定", "秦皇岛" }, { "河南", "郑州", "开封", "洛阳", "平顶山", "焦作", "鹤壁", "新乡", "安阳", "濮阳", "许昌", "漯河", "三门峡", "南阳", "商丘", "信阳", "周口", "驻马店" }, { "山东", "济南", "青岛", "淄博", "威海", "曲阜", "临沂", "烟台", "枣庄", "聊城", "济宁", "菏泽", "泰安", "日照", "东营", "德州", "滨州", "莱芜", "潍坊" }, { "山西", "太原", "阳泉", "晋城", "晋中", "临汾", "运城", "长治", "朔州", "忻州", "大同" },
			{ "江苏", "南京", "苏州", "昆山", "南通", "太仓", "吴县", "徐州", "宜兴", "镇江", "淮安", "常熟", "盐城", "泰州", "无锡", "连云港", "扬州", "常州", "宿迁" }, { "安徽", "合肥", "巢湖", "蚌埠", "安庆", "六安", "滁州", "马鞍山", "阜阳", "宣城", "铜陵", "淮北", "芜湖", "毫州", "宿州", "淮南", "池州" }, { "陕西", "西安", "韩城", "安康", "汉中", "宝鸡", "咸阳", "榆林", "渭南", "商洛", "铜川", "延安" }, { "宁夏", "银川", "固原", "中卫", "石嘴山", "吴忠" }, { "甘肃", "兰州", "白银", "庆阳", "酒泉", "天水", "武威", "张掖", "甘南", "临夏", "平凉", "定西", "金昌" }, { "青海", "西宁", "海北", "海西", "黄南", "果洛", "玉树", "海东", "海南" },
			{ "湖北", "武汉", "宜昌", "黄冈", "恩施", "荆州", "神农架", "十堰", "咸宁", "襄樊", "孝感", "随州", "黄石", "荆门", "鄂州" }, { "湖南", "长沙", "邵阳", "常德", "郴州", "吉首", "株洲", "娄底", "湘潭", "益阳", "永州", "岳阳", "衡阳", "怀化", "韶山", "张家界" }, { "浙江", "杭州", "湖州", "金华", "宁波", "丽水", "绍兴", "雁荡山", "衢州", "嘉兴", "台州", "舟山", "温州" }, { "江西", "南昌", "萍乡", "九江", "上饶", "抚州", "吉安", "鹰潭", "宜春", "新余", "景德镇", "赣州" }, { "福建", "福州", "厦门", "龙岩", "南平", "宁德", "莆田", "泉州", "三明", "漳州" }, { "贵州", "贵阳", "安顺", "赤水", "遵义", "铜仁", "六盘水", "毕节", "凯里", "都匀" },
			{ "四川", "成都", "泸州", "内江", "凉山", "阿坝", "巴中", "广元", "乐山", "绵阳", "德阳", "攀枝花", "雅安", "宜宾", "自贡", "甘孜州", "达州", "资阳", "广安", "遂宁", "眉山", "南充" }, { "广东", "广州", "深圳", "潮州", "韶关", "湛江", "惠州", "清远", "东莞", "江门", "茂名", "肇庆", "汕尾", "河源", "揭阳", "梅州", "中山", "德庆", "阳江", "云浮", "珠海", "汕头" }, { "广西", "南宁", "桂林", "阳朔", "柳州", "梧州", "玉林", "桂平", "贺州", "钦州", "贵港", "防城港", "百色", "北海", "河池", "来宾", "崇左" }, { "云南", "昆明", "保山", "楚雄", "德宏", "红河", "临沧", "怒江", "曲靖", "思茅", "文山", "玉溪", "昭通", "丽江", "大理" },
			{ "海南", "海口", "三亚", "儋州", "琼山", "通什", "文昌" }, { "新疆", "乌鲁木齐", "阿勒泰", "阿克苏", "昌吉", "哈密", "和田", "喀什", "克拉玛依", "石河子", "塔城", "库尔勒", "吐鲁番" }, { "西藏", "拉萨", "阿里", "昌都", "那曲", "日喀则", "山南", "林芝" }, { "台湾", "台北", "高雄" }, };
	public static final int AREA_CODE[][] = { { 1, 54511, 58367, 54517, 57516 }, { 2, 45005, 45011 }, { 3, 50953, 50745, 54094, 50842, 50774, 50884, 50775, 50978, 50873, 50971, 50468, 50853, 50442 }, { 4, 54161, 99999, 54172, 54371, 50936, 54157, 50946, 54260, 50945, 54363 }, { 5, 54342, 54662, 54453, 54660, 54346, 54353, 54249, 54347, 54471, 54237, 54324, 54337, 54497, 54339 }, { 6, 53463, 99999, 54102, 53446, 54218, 50527, 53512, 53543, 54102, 54135 },
			{ 7, 53698, 54534, 54401, 54515, 53798, 53892, 54616, 54702, 54423, 54602, 54449 }, { 8, 57083, 57091, 57073, 57171, 53982, 53990, 53986, 53898, 54900, 57089, 57186, 57051, 57178, 58005, 57297, 57195, 57290 }, { 9, 54823, 54857, 54830, 54774, 54918, 54938, 54765, 58024, 54806, 54915, 54906, 54827, 54945, 54736, 54714, 54734, 54828, 54843 }, { 10, 53772, 53782, 53976, 53778, 53868, 53959, 53882, 53578, 53674, 53487 },
			{ 11, 58238, 58357, 58356, 58259, 58377, 58349, 58027, 58346, 58248, 58145, 58352, 58151, 58246, 58354, 58044, 58245, 58343, 58131 }, { 12, 58321, 58326, 58221, 58424, 58311, 58236, 58336, 58203, 58433, 58429, 58116, 58334, 99999, 58122, 58224, 58427 }, { 13, 57036, 53955, 57245, 57127, 57016, 57048, 53646, 57045, 57143, 53947, 53845 }, { 14, 53614, 53817, 53704, 53518, 53612 }, { 15, 52889, 52896, 53829, 52533, 57006, 52679, 52652, 50741, 52984, 53915, 52995, 52675 },
			{ 16, 52866, 52754, 52737, 56065, 56043, 56029, 52875, 52856 }, { 17, 57494, 57461, 57498, 57447, 57476, 57362, 57256, 57590, 57278, 57482, 57381, 58407, 57377, 57496 }, { 18, 57687, 57766, 57662, 57972, 57649, 57780, 57763, 57773, 99999, 57866, 57584, 57872, 57749, 57771, 57558 }, { 19, 58457, 58450, 58549, 58563, 58646, 58453, 99999, 58633, 58452, 58660, 58477, 58659 }, { 20, 58606, 57786, 58502, 58637, 58617, 57799, 58627, 57793, 57796, 58527, 57993 },
			{ 21, 58847, 59134, 58927, 58834, 58846, 58946, 59137, 58828, 59126 }, { 22, 57816, 57806, 57609, 57713, 57741, 56693, 57707, 57825, 57827 }, { 23, 56294, 57602, 57504, 56571, 56171, 57313, 57206, 56386, 56196, 56198, 56666, 56287, 56492, 56396, 56146, 57328, 56298, 57415, 57405, 56391, 57411 }, { 24, 59287, 59493, 59312, 59082, 59658, 59298, 59280, 59289, 59473, 59659, 59278, 59501, 59293, 59315, 59117, 59485, 59269, 59663, 59471, 59488, 59316 },
			{ 25, 59431, 57957, 59051, 59046, 59265, 59453, 59254, 59065, 59632, 59249, 59635, 59211, 59644, 59023, 59242, 59425 }, { 26, 56778, 56748, 56768, 56844, 56975, 56951, 56533, 56783, 56964, 56994, 56875, 56586, 56651, 56751 }, { 27, 59758, 59948, 59845, 59757, 59941, 59856 }, { 28, 51463, 51076, 51628, 51368, 52203, 51828, 51709, 51243, 51356, 51133, 51656, 51573 }, { 29, 55591, 55437, 56137, 55299, 55578, 55598, 56312 }, { 30, 58968, 59554 } };

	public static final String AREA_TYPE2[][] = { { "亚洲", "东京", "京都", "汉城", "釜山", "乌兰巴托", "马尼拉", "河内", "新加坡", "雅加达", "仰光", "阿拉木图", "科伦坡", "新德里", "孟买", "曼谷", "卡拉奇", "德黑兰", "利雅得", "吉隆坡", "伊斯坦布尔" }, { "北美洲", "温哥华", "纽约", "旧金山", "达拉斯－沃斯堡", "西雅图", "拉斯维加斯", "洛杉矶", "圣地亚哥", "休斯敦", "迈阿密", "亚特兰大", "芝加哥", "华盛顿", "波士顿", "渥太华", "蒙特利尔", "多伦多", "渥太华", "墨西哥城" }, { "南美洲", "圣保罗", "加拉加斯", "利马", "里约热内卢", "布里诺斯艾利斯" }, { "大洋州", "惠灵顿", "悉尼", "墨尔本" }, { "非洲", "开罗", "突尼斯", "达喀尔", "金沙萨", "内罗毕", "开普敦", "约翰内斯堡" },
			{ "欧洲", "罗马", "雅典", "巴黎", "巴塞罗那", "伦敦", "莫斯科", "斯德哥尔摩", "赫尔辛基", "柏林", "法兰克福", "汉堡", "阿姆斯特丹", "布鲁塞尔", "苏黎世", "日内瓦", "维也纳", "米兰", "马赛", "曼彻斯特", "马德里" } };

	public static final int AREA_CODE2[][] = { { 1, 47662, 99999, 47108, 47159, 99999, 99999, 48820, 99999, 96745, 48097, 99999, 43466, 42182, 99999, 48454, 41781, 40754, 99999, 48647, 17060 }, { 2, 71892, 72503, 72494, 72259, 72793, 72386, 72295, 78264, 72243, 72202, 72219, 72534, 72403, 72509, 71628, 71627, 71624, 71628, 99999 }, { 3, 99999, 99999, 84628, 99999, 87585 }, { 4, 93436, 94767, 94868 }, { 5, 99999, 99999, 99999, 99999, 63740, 68816, 68368 },
			{ 6, 16235, 16701, 99999, 99999, 3779, 27612, 2484, 2974, 10381, 10637, 10141, 06240, 06451, 06660, 06700, 11034, 16066, 99999, 03334, 99999 } };

	public static Communityweather find(int node) throws SQLException
	{
		Communityweather obj = (Communityweather) _cache.get(new Integer(node));
		if (obj == null)
		{
			obj = new Communityweather(node);
			_cache.put(new Integer(node), obj);
		}
		return obj;
	}

	public Communityweather(String community, int area, int node) throws SQLException
	{
		this.community = community;
		this.area = area;
		this.node = node;
		this.exists = true;
	}

	public Communityweather(int node) throws SQLException
	{
		this.node = node;
		loadBasic();
	}

	private void loadBasic() throws SQLException
	{
		DbAdapter dbadapter = new DbAdapter();
		try
		{
			dbadapter.executeQuery("SELECT community,area FROM Communityweather WHERE node=" + node);
			if (dbadapter.next())
			{
				community = dbadapter.getString(1);
				area = dbadapter.getInt(2);
				exists = true;
			} else
			{
				exists = false;
			}
		} finally
		{
			dbadapter.close();
		}
	}

	public static java.util.Enumeration findByCommunity(String community, int pos, int size) throws SQLException
	{
		java.util.Vector v = new java.util.Vector();
		DbAdapter dbadapter = new DbAdapter();
		try
		{
			dbadapter.executeQuery("SELECT area,node FROM Communityweather WHERE community=" + DbAdapter.cite(community));
			while (dbadapter.next())
			{
				int area = dbadapter.getInt(1);
				int node = dbadapter.getInt(2);
				v.addElement(new Communityweather(community, area, node));
			}
		} finally
		{
			dbadapter.close();
		}
		return v.elements();
	}

	public void set(int area) throws SQLException
	{
		DbAdapter dbadapter = new DbAdapter();
		try
		{
			dbadapter.executeUpdate("UPDATE Communityweather SET area=" + area + " WHERE node=" + node);
		} finally
		{
			dbadapter.close();
		}
		this.area = area;
	}

	public static void create(String community, int area, int node) throws SQLException
	{
		DbAdapter dbadapter = new DbAdapter();
		try
		{
			dbadapter.executeUpdate("INSERT INTO Communityweather(community,area,node)VALUES(" + DbAdapter.cite(community) + "," + area + "," + node + ")");
		} finally
		{
			dbadapter.close();
		}
		_cache.remove(new Integer(node));
	}

	public void delete() throws SQLException
	{
		DbAdapter dbadapter = new DbAdapter();
		try
		{
			dbadapter.executeUpdate("DELETE FROM Communityweather WHERE node=" + node);
		} finally
		{
			dbadapter.close();
		}
		exists = false;
		_cache.remove(new Integer(node));
	}

	public String getCommunity()
	{
		return community;
	}

	public boolean isExists()
	{
		return exists;
	}

	public int getNode()
	{
		return node;
	}

	public int getArea()
	{
		return area;
	}

}
